9/data/attachments/e5e820e34e28b866.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>William_unit_Friend_87156_0</nif:username>
            <nif:friendToBeRequested>soap_friends_939e287c-39e9-4206-bdff-c75e5898395a</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>